# PassesFilter Method (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AreaTagFilter..::..PassesFilter Method
AreaTagFilter Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| PassesFilter(Element) | Applies the filter to a given element.  (Inherited from ElementFilter.) |
| PassesFilter(Document, ElementId) | Applies the filter to a given element.  (Inherited from ElementFilter.) |

# See Also
AreaTagFilter Class
AreaTagFilter Members
Autodesk.Revit.DB Namespace